app/views/home/index.html.erb

<h3>Your Companies</h3>
<% current_user.companies.each do |c| %>
---
SELECT "companies".* FROM "companies" WHERE ("companies".owner_id = 1)