app/controllers/company_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
---
  def find_company
    @company = Company.find(params[:id])