app/controllers/intuit_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."realm" = '547147730' LIMIT 1
UPDATE "companies" SET "owner_id" = 3, "intuit_access_token" = 'qyprdztsVKC0LJ7mAIyDiBMlfLijCYW7i8pyy0FHBV7ojDaX', "intuit_access_secret" = 'e1EtAiDuMlSsIUVcYepMm2gSbuNP5Js1XVkA8Ohq', "updated_at" = '2012-11-16 21:43:26.331551' WHERE "companies"."id" = 1
INSERT INTO "companies" ("name", "realm", "owner_id", "intuit_access_token", "intuit_access_secret", "is_qbo", "created_at", "updated_at") VALUES ('', '547147730', 1, 'qyprdSuJWqvrNCymowZ3BVuuK2IydaLO4HzouNjwBp5kCe8W', 'K7wtAiy6fwKXO69rQoDJyNiJR2cGzA0qR398GDwM', 't', '2012-11-16 20:26:34.504381', '2012-11-16 20:26:34.504381')
---
  def callback
    at = session[:request_token].get_access_token(:oauth_verifier => params[:oauth_verifier])
    session[:request_token] = nil
    if(@company = Company.where(:realm => params["realmId"]).first)
      @company.update_attributes(:owner => current_user, :intuit_access_token => at.token, :intuit_access_secret => at.secret)
    else
      @company = Company.create(
        :intuit_access_token => at.token,
        :intuit_access_secret => at.secret,
        :realm => params["realmId"],
        :owner => current_user,
        :name => "",
        :is_qbo => params["dataSource"] == "QBO"
      )

SELECT "users".* FROM "users" WHERE "users"."openid_identifier" = 'https://openid.intuit.com/Identity-f2ab9a79-9873-4fe7-96af-e8f7ba709f48' LIMIT 1
INSERT INTO "users" ("first_name", "last_name", "email", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "openid_identifier", "created_at", "updated_at") VALUES (NULL, NULL, 'jdestradap@gmail.com', NULL, NULL, '307d7cf79ea5a3684db229afb72388231b30502c87abe9e3d2f8a5aa0aab12a49c482709a2c69109a2c4a12712f2aa31af5be897889a765c11aee573074acb46', 'GrpWY2RQ0Sm0g6IGs1Q', 'zBeSa2AHLiJOoEa6LjH', 'https://openid.intuit.com/Identity-f2ab9a79-9873-4fe7-96af-e8f7ba709f48', '2012-11-16 15:54:53.201222', '2012-11-16 15:54:53.201222')
SELECT 1 FROM "users" WHERE (LOWER("users"."email") = LOWER('jdestradap@gmail.com')) LIMIT 1
---
  def sso_complete
    parameters = params.reject{|k,v|request.path_parameters[k]}
    parameters.delete("controller")
    parameters.delete("action")
    response = openid_consumer.complete(parameters, complete_intuit_sso_url)
    Rails.logger.debug(response.status == OpenID::Consumer::FAILURE)
    case response.status
    when OpenID::Consumer::FAILURE
      redirect_to (logged_in? ? root_path : login_path), :notice => (response.display_identifier ? "Verification of #{response.display_identifier} failed: #{response.message}" : "Verification failed: #{response.message}")
      return
    when OpenID::Consumer::SUCCESS
      sreg_resp = OpenID::SReg::Response.from_success_response(response)
      if response.identity_url && u = User.find_by_openid_identifier(response.identity_url)
        UserSession.create(u)
        if(session[:from_intuit])
          render :action => "ia", :layout => false
        else
          redirect_to root_path, :notice => "You have logged in!"
        end
      elsif logged_in?
        session[:oid] = response.identity_url
        render :action => "verify_link"
      elsif u = User.find_by_email(sreg_resp["email"])

UPDATE "users" SET "openid_identifier" = 'https://openid.intuit.com/Identity-f2ab9a79-9873-4fe7-96af-e8f7ba709f48', "perishable_token" = 'ptxbjysA8rDcPkZQeIZR', "updated_at" = '2012-11-16 23:05:40.364547' WHERE "users"."id" = 4
---
  def sso_link
    current_user.openid_identifier = session[:oid]
    current_user.save