app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "openid_identifier", "created_at", "updated_at") VALUES ('Camilo', 'Marin', 'cmarin@gmail.com', '71536b785b34f8e873bffc6a7f52bab2f4900f0e4fe25dba5138d05998e56a94c58306b93bf6b3993e0692123cf6da617e87d75398dc64a7bfcd3480fd0ac04d', '5hWVAlDGx2LLCIovY', '3dd8c16cf1da820c18db4de95ceb0580989b318ca9515b42117215102161a23ef0583d0fea26b2ed3322f984b7bb17416b5070aef7760b0c1e0e82fda504f665', 'K6xUE9SDZmTM4fSPXFW', 'm59jOfBhhHXOggGek', NULL, '2012-11-16 21:42:51.077909', '2012-11-16 21:42:51.077909')